
const arrayExample = [
    {
        "typeText": "h1",
        "jp": "ゲームに最適なVPN"
    },
    {
        "typeText": "h2",
        "jp": "ラグなしのVPNでスムーズなゲームプレイをお楽しみください。Pingを下げて、速度制限なしでプレイしましょう。"
    },
    {
        "typeText": "cta",
        "jp": "VPNを購入する"
    },
    {
        "typeText": "h3",
        "jp": "30日間返金保証"
    },
    {
        "typeText": "h2",
        "jp": "ゲーミングVPNの設定方法"
    },
    {
        "typeText": "h3",
        "jp": "PC、モバイルデバイス、ラップトップ用のゲーミングVPNをダウンロードしてください。"
    },
    {
        "typeText": "h3",
        "jp": "VPNを利用して低Pingでゲームをお楽しみください。"
    },
    {
        "typeText": "h3",
        "jp": "\nXbox、PS4、その他のゲーム機用のルーター-VPNを設定する。"
    },
    {
        "typeText": "h2",
        "jp": "ゲーミングVPNはどのような課題を解決するのか？"
    },
    {
        "typeText": "h3",
        "jp": "国境を越えてゲームにアクセスする方法"
    },
    {
        "typeText": "h3",
        "jp": "地域制限や検閲なしで、世界中でゲームが楽しめます。世界中のどこにいても、簡単に地域を切り替えて友達とゲームを楽しめます。"
    },
    {
        "typeText": "h3",
        "jp": "Pingを下げる方法"
    },
    {
        "typeText": "h3",
        "jp": "グローバルなWhoer VPNネットワークから最も近いサーバーを選択することで、簡単に低pingを達成することができます。高pingによるゲームの遅延とはおさらばです。"
    },
    {
        "typeText": "h3",
        "jp": "ISPのスロットリングを回避する方法"
    },
    {
        "typeText": "h3",
        "jp": "プロバイダーによる帯域幅制限が解除されました。プロバイダに接続を検知されることなく、高速ゲームをお楽しみいただけます。"
    },
    {
        "typeText": "h3",
        "jp": "DDoS攻撃から身を守るには"
    },
    {
        "typeText": "h3",
        "jp": "最高のゲームVPNであなたのゲームアカウントをサイバー攻撃から守りましょう。公共のWiFiでも安全にプレイできます。"
    },
    {
        "typeText": "h2",
        "jp": "VPNで最も人気のあるゲームをプレイ"
    },
    {
        "typeText": "h3",
        "jp": "Steamとお気に入りのゲームのためにシームレスなVPNを設定します。Whoer VPNでBrawl StarsやMinecraftをグローバルにプレイし、地理的制限や検閲なしに最新バージョンのゲームにアクセスしましょう。PUBG用の低ping VPNでユニークなゲーム体験を楽しみ、Diablo、Galaxy Online、Lineage 2: Essence、Lost Arkなどの最新ゲームにアクセスしましょう。"
    },
    {
        "typeText": "h2",
        "jp": "すべてのデバイスでVPNを使用してゲームを楽しむ"
    },
    {
        "typeText": "h2",
        "jp": "VPNでゲーム中のpingを最小限に抑える方法"
    },
    {
        "typeText": "h3",
        "jp": "Pingが高いということは、あなたのデバイスからゲームサーバーに送信される情報パケットに時間がかかりすぎていることを示しています。pingが大きいと、あなたの行動とゲーム内の応答が大幅に遅れる可能性があります。このため、オンラインゲーマーは主にpingを減らすことに注力しています。\n\nゲーム中のpingに不満がある場合は、ゲームサーバーに近い国のVPNサーバーに接続し、pingを最小限に抑えることも解決策の1つです。"
    },
    {
        "typeText": "h2",
        "jp": "ゲームに最適なVPNの選び方"
    },
    {
        "typeText": "h3",
        "jp": "お使いのデバイスに合わせたカスタマイズ"
    },
    {
        "typeText": "h3",
        "jp": "Whoer VPNは、様々なゲーム機器向けの専用アプリを提供しています。さらに、ルーターにVPNをインストールすることで、ゲーム機を含むすべてのデバイスをカバーすることができます。"
    },
    {
        "typeText": "h3",
        "jp": "世界中のサーバー"
    },
    {
        "typeText": "h3",
        "jp": "グローバルなWhoer VPNネットワークからサーバーを選択し、pingを減らし、地理的な制限を回避することで、あなたの経験を最大化します。"
    },
    {
        "typeText": "h3",
        "jp": "接続の保護"
    },
    {
        "typeText": "h3",
        "jp": "Whoer VPNは最先端の暗号化プロトコルを採用し、お客様のゲームアカウントを安全に保護し、第三者のアクセスから守ります。"
    },
    {
        "typeText": "h3",
        "jp": "高速接続"
    },
    {
        "typeText": "h3",
        "jp": "ゲーム中、Whoer VPNで制限のないスピードと帯域幅を体験してください。今すぐ無制限のゲームVPNをお試しください！"
    },
    {
        "typeText": "h3",
        "jp": "Whoer VPNがあれば、あなたのゲーム機は保護され、制限から解放されます。Xbox、PS4、その他のゲーム機でVPNを利用するには、Whoer VPNをルーターにインストールしてください。これにより、ネットワーク内のすべてのデバイスが保護され、国境を越えたゲームプレイが容易になります。低Pingと制限のないスピードで、コンソールでのゲームをご体験ください！"
    },
    {
        "typeText": "h2",
        "jp": "よくある質問"
    },
    {
        "typeText": "h3",
        "jp": "ゲームに最適なVPNは？"
    },
    {
        "typeText": "h3",
        "jp": "ゲームに最適なVPNは、あなたのデバイス専用に設計されており、ジオブロックを回避し、Pingを最小限に抑えるために適切なサーバーを選択することができます。"
    },
    {
        "typeText": "h3",
        "jp": "vpnはゲームに何をもたらすのか？"
    },
    {
        "typeText": "h3",
        "jp": "ゲームVPNに接続することで、人気のゲームを地理的な境界や検閲なしにプレイしたり、プロバイダーが課す速度制限を回避したり、pingを減らしたり、ハッキングやDDoS攻撃からゲームアカウントを保護したりすることができます。"
    },
    {
        "typeText": "h3",
        "jp": "ゲーム中にインターネットが低速になるのはなぜですか？"
    },
    {
        "typeText": "h3",
        "jp": "特定のリソース、特にゲームやストリーミングプラットフォームにアクセスする際に、インターネットサービスプロバイダが意図的に接続速度を低下させるスロットリングが発生している可能性があります。これにより、プロバイダーは帯域幅の使用量を管理することができます。VPNを利用することで、プロバイダーによる速度制限を回避することができます。"
    },
    {
        "typeText": "h3",
        "jp": "最適なpingとは？"
    },
    {
        "typeText": "h3",
        "jp": "ゲームにおける良いpingとは、低いpingのことです。Whoer.netサービスを使ってpingをチェックしてください。ゲームサーバーに最も近いVPNサーバーに接続し、pingをできるだけ小さくしましょう。"
    },
    {
        "typeText": "h3",
        "jp": "TwitchでVPNを使ってストリーミングできますか？"
    },
    {
        "typeText": "h3",
        "jp": "Twitchに最適なVPNを選ぶには？ゲーム用の無料VPNサービスは、ストリーミング・プラットフォームへのアクセスを制限し、速度を制限することが多い。無制限のゲームとストリーミングのために、Whoer VPNのサブスクリプションを選択してください。Twitchであなたのゲーム体験を友達やフォロワーと共有しましょう。"
    }
]

const uniqueTypeTextArray = arrayExample.map((obj, index) => {
    return {
        ...obj,
        typeText: `${obj.typeText}-${index}`
    };
});

const nameSection = 'vpn.for-games.'

// typeText и jp это названия столбцов в exel
uniqueTypeTextArray.map(element => {
    console.log(`"${nameSection}${element.typeText}"`, '=>', `"${element.jp}",`)
})


